sample/app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "こんにちは"], ["user_id", 1], ["created_at", "2022-02-23 14:50:40.143828"], ["updated_at", "2022-02-23 14:50:40.143828"]]
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "初投稿"], ["user_id", 1], ["created_at", "2022-02-23 15:39:08.600724"], ["updated_at", "2022-02-23 15:39:08.600724"]]
SELECT "microposts".* FROM "microposts" WHERE (user_id = 1) ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    # 許可済み属性リストにimageを追加する
    @micropost.image.attach(params[:micropost][:image])
    if @micropost.save
      flash[:success] = "Micropost created!"
      redirect_to root_url
    else
      @feed_items = current_user.feed.paginate(page: params[:page])